ico_KFOAM_example/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v3.0+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

11
(
    inlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          4150;
        startFace       1663028;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  outlet;
    }
    outlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          4150;
        startFace       1667178;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inlet;
    }
    front
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          6072;
        startFace       1671328;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  back;
    }
    back
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          6072;
        startFace       1677400;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  front;
    }
    up
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          4150;
        startFace       1683472;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  down;
    }
    down
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          4150;
        startFace       1687622;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  up;
    }
    fibre
    {
        type            patch;
        nFaces          14400;
        startFace       1691772;
    }
    fibre1
    {
        type            patch;
        nFaces          3600;
        startFace       1706172;
    }
    fibre2
    {
        type            patch;
        nFaces          3600;
        startFace       1709772;
    }
    fibre3
    {
        type            patch;
        nFaces          3600;
        startFace       1713372;
    }
    fibre4
    {
        type            patch;
        nFaces          3600;
        startFace       1716972;
    }
)

// ************************************************************************* //
