ico_KFOAM_example/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
//   default         Euler;
	// default   CrankNicolson 0.6;
default backward;
}

gradSchemes
{
   // default         Gauss linear;
	default cellMDLimited Gauss linear 0.5;
}

divSchemes
{
    default         Gauss linear;
	div(phi,U) Gauss linearUpwind grad(U);

    //div(phi,U)      Gauss limitedLinearV 1;
}

laplacianSchemes
{
    default         Gauss linear corrected;
    default 	Gauss linear orthogonal;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    //default         corrected;
	default 	orthogonal;
}

fluxRequired
{
    default         no;
    p               ;
}


// ************************************************************************* //
