ico_KFOAM_example/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
	d
	{
		solver		GAMG;
		tolerance	1e-5;
		relTol		0.05;
		smoother	GaussSeidel;
		nPreSweeps	0;
		nPostSweeps	2;
		cacheAgglomeration on;
		agglomerator	faceAreaPair;
		nCellsInCoarsestLevel 1000;

		mergeLevels	1;
	}

	dFinal
	{
		solver		GAMG;
		tolerance	1e-6;
		relTol		0.0;
		smoother	GaussSeidel;
		nPreSweeps	0;
		nPostSweeps	2;
		cacheAgglomeration on;
		agglomerator	faceAreaPair;
		nCellsInCoarsestLevel 1000;
		mergeLevels	1;
	}

	D
	{
		solver		PBiCG;
		preconditioner	DILU;
		tolerance	1e-08;
		relTol		0;
	}

}

PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 1;
    dRefCell        0;
    dRefValue       0;
}

potentialFlow
{
    nNonOrthogonalCorrectors 1;
}

// ************************************************************************* //
